#大模型
# 大模型应用
# 1.本地部署ollama 训练好的接入本地：用本地算力较低1
# 2.api（应用程序编程接口（Application Programming Interface, API） [1]，也称应用编程接口，是一组为不同软件组件之间交互而创建的定义和协议。API定义了软件模块之间如何相互交互，包括可以调用哪些功能、如何调用、需要提供的数据格式，以及返回结果的形式。通过API，开发者可以复用现有能力，而无需了解或修改底层实现细节。）
#   客户端调用服务端

# 计算机网络

# IP地址：设备在互联网中的地址
# IPv4地址：32位二进制
# 132.12.86.125（0-255）：100001000.00001100.01010110.01111101
# 127.0.0.1：是一个特殊的IP地址，表示的是本机地址（也称本地回环地址）（访问本地某个服务）
# IPv6地址：128位二进制

#域名：
# 是由一串用点隔的英文字母组成。IP地址不方便记忆，因此设计出了域名，并通过DNS（域名解析服务器）来将域名和IP地址互相映射，便于记忆和访问
# 已定位到某个服务器后：要访问那个应用需要用到端口

# 端口：
# 端口号是整数，取值范围在0-65535，它是用来标识计算机设备中运行的程序
# 端口号体现在哪？：采用http协议默认端口号为80，https协议默认端口号为443

# 总结：用IP地址/域名定位设备，再用端口号地位应用程序，这样客户端和服务器端建立连接

# 然后数据传输：数据传输的规则
# 国际IOS组织统一了程序在网络通信中的模型和标准：
# 1.OSI网络模型：七层：从下网上
# 2.TCP/IP（可认为OSi简化版）：四层：网络接口层-网络层（）-传输层-应用层










