//操作系统
//1.
//操作系统的概念：
//裸机->操作系统->软件->用户
//1.管理硬件软件资源；2.提供给用户和其他软件方便的接口和环境；3.计算机系统中最基本的系统软件

//资源的管理者：1.处理机（cpu）管理2.存储器管理3.文件管理4.设备管理
//如何设计和实现！

//向上提供方便易用的服务（封装思想 简->二进制）
//用户：1.gui（用户图像界面）2.提供命令接口：（联机）交互式命令接口cmd （批处理）脱机命令接口+程序接口

//对硬件机器的扩展：扩充机器，硬件组合起来拓展

//2.
//操做系统的四个特征：
//并发/共享（两个最基本的特征，二者互为存在条件） 虚拟异步；
//并发：宏观同时发生，微观交替 并行：同时
////单核cpu-单个程序-并发；多核-多个程序-可并行
//共享：互斥共享（一个时间段只允许一个进程访问该资源，摄像头），同时共享（文件读取（但微观上交替））
//虚拟：空分复用技术（看似内存增大，虚拟存储器），时分复用技术（看似同时，虚拟）<-并发性
//异步：程序并发进行，争抢资源，会产生异步。<-并发性

//3.
//操作系统的发展：
//手工操作系统：人机速度矛盾
//单道批畜栏里系统（引入脱机输入输出技术）：缓解人机速率矛盾，资源利用率仍然很低
//多道批处理系统（操作系统开始出现）：多道程序并发执行，不提供人机交互；
//分时操作系统：提供人机交互，不能优先处理紧急任务
//实时操作系：硬实时，软实时；

//4.
//操作系统的运行机制
//c-编译器-二进制机器指令-cpu执行
//应用程序，内核程序（操作系统的内核）
//为了使cpu区分应用还是内核程序-内核态，应用态；
//cpu程序状态寄存器（PSW）（1，0）
//执行特权指令将内核态转为用户态；
//if cpu(用户太) scan privilege code-中断信号-变为内核态

//5.
//中断和异常：
// 中断：让操作系统内核强行cpu使用权夺回，使cpu从用户态变为内核态
//内中断（异常）：cpu在执行当前指令引发的中断，例：1.陷入（trap）（故意）陷入指令2.故障3.终止，/0
//外中断（中断）：时钟中断：实现并发运行，I/O中断：由输入输出设备发来的中断信号。
//中断机制的基本原理：
//不同的中断信号，需要用不同的中断处理程序来处理：
//检查信号：内：执行时检查，外：每个指令周期的末尾->cpu查询“中断向量表”->中断处理程序（内核态）

//6.
//系统调用：
//操作系统向上提供的接口，给程序用的程序接口，由一组系统调用组成：
//可以理解为一种可供应用程序调用的特殊函数，应用程序可以通过系统调用来请求获得操作系统内核的服务。
//凡是对共享资源有关的操作，都必须通过系统调用向操作系统内核提出服务请求，由操作系统内核代完成，保证系统的稳定性安全性
//过程：
//用户态传入参数到寄存器->陷入指令（内中断：变为内核态）：系统调用入口程序->检查寄存器参数调用对应处理程序->用户态继续执行其他应用程序

//7.
//操作系统的体系结构：
//内核：内核是操作系统最核心最基本的部分，实现操作系统内核功能的那些程序就是内核程序。
//    1.（硬件关联紧密）时钟管理，中断处理，原语：特殊的程序，处于操作系统的最底层，最接近硬件，具有原子性（运行不可中断），运行时间较短操作频繁
//    2.（更多对数据结构的操作）对系统资源进行管理的功能：进程管理，存储器管理，设备管理
//1何2叫大内核，1叫微内核->运行在内核态，其它非内核功能运行在用户态，微内核2也在用户态
//分层结构：便于调试验证，接口清晰。仅可以调用相邻低层，难以合理定义各层边界，效率低不能跨层调用
//模块化：将内核划分为多个模块，之间相互协作
//       内核=主模块+可加载的内核模块，主模块：只负责核心功能，如进程调度，内存管理。可加载的内核模块：动态加载新模块无需编译整个内核
//       模块间逻辑清晰易于维护，支持动态加载，彼此可相互调用效率高。接口定义未必合理，实用，模块间相互依赖难验证
//外核：给用户进程未经抽象的硬件资源（分配连续地址）。灵活性能提升，减少虚拟硬件的“映射层”。降低系统的一致性，是系统更复杂

//8.
//操作系统的引导：
//定义：开机的时候怎样让操作系统运行起来？
//磁盘：最初是空的，安装操作系统后：
//主引导记录（MBR）(包含磁盘引导程序和分区表)
//->C:盘（是这个磁盘的活动分区，安装了操作系统）：引导记录PBR(负责找到启动管理器)->根目录->其它
//DEF盘
//计算机的主存：RAM，ROM（BIOS：basic i/o system），包含：ROM引导程序即自举程序
//引导流程：见图

//9.
//虚拟机：
//定义：使用虚拟化技术，将一台物理机器虚拟化为多台虚拟机器（VM），每个虚拟机器都可以独立运行一个操作系统
//同意术语：虚拟机管理程序/虚拟机监控程序/VMM
//第一类（直接运行在硬件上）：
//把硬件资源进行划分，cpu（划分时间片），磁盘内存（空间划分）
//第二类（运行在宿主操作系统上）
//申请硬件资源依赖host os，host os分配，然后用户操作系统再分配
//二者详细比较图：见图

//10.
//进程的概念组成特征：
//概念：
//程序：是静态的，就是个存放在磁盘里的可执行文件，就是一系列的指令集合。
//进程：是动态的，是程序的一次执行过程
//当进程被创建，操作系统会为该进程分配唯一的，不重复的“身份证号”--PID（process id）
//操作系统记录pid uid：区分
//进程分配了哪些资源（内存，设备，文件）：对资源管理
//进程运行情况（cpu使用时间，磁盘，网络）：控制调度
//信息都被保存一个数据结构PCB（进程控制块），操作系统需要对各个并发运行的进程进行管理，管理时所需要的信息，都会放在PCB中
//进程的组成：1.PCB，2.程序段，3。数据段
//总结：编写程序->.exe可执行文件（硬盘）->运行前需要把程序放入内存：PCB，程序段（cpu从内存中取出指令），数据段--包含运行过程中产生的各种数据
//程序段，数据段，pcb三部分组成了进程实体（进程映像）
//引入进程实体概念后可把进程定义为：
//进程是进程实体的运行过程，是系统进行资源分配和调度的一个独立单位
//注意：PCB是进程存在的唯一标志

//11.
//进程的状态与转换：
//创建态->就绪态->运行态（->阻塞态）->终止态
//见图
//三种基本状态：运行态（占有cpu，并在cpu上运行），就绪态（已经具备运行条件，但由于没有空闲的cpu，而暂时不能运行），阻塞态（因等待某一事件而暂时不能运行）
//另外两种状态：创建态（进程正在被创建，操作系统为其分配资源，初始化PCB），终止态（进程正在从系统中撤销，操作系统会回收进程拥有资源，撤销PCB）
//进程的PCB中，变量state表示进程当前状态
//进程的组织：
//1链式方式：链表，按照进程状态将PCB分为多个队列
//2索引方式
//高频考点见图

//12.
//进程控制：
//进程的状态的转换
//由原语实现，原语具有原子性，执行不可被中断，“关中断”“开中断”两个特权指令实现原子性（内核程序）
//cpu执行关中断指令后，不再检查中断信号，直到执行开中断才会恢复检查
//一/进程的创建：
//1创建原语：申请空白PCB，为新进程分配所需资源，初始化PCB，将PCB插入就绪队列（创建态->就绪态）
//2引起进程创建的事件：用户登录，作业调度，提供服务，应用请求
//二/进程的终止：
//1撤销原语：从PCB集合找到终止进程的PCB，若进程正在运行，立即剥夺cpu，将cpu分配给其他进程，终止其所有子进程,将该进程拥有的所有资源归还父进程或操作系统，删除PCB
//2引起进程终止的事件：正常结束（exit），异常结束（/0），外界干预
//三/进程的阻塞和唤醒：
//进程的阻塞：
//1.阻塞原语：找到pcb，保护现场，state成阻塞态，下处理机插入等待队列
//进程的唤醒：
//1.唤醒原语：在等待队列找到pcb，等待队列移除，设置就绪态插入就绪队列
//2.事件：因什么阻塞
//四/进程的切换（运行态->就绪态，就绪态->运行态）：
//1.切换原语：运行环境（程序中间结果）存入pcb，pcb移入相应队列，选择另一个进程执行更新pcb，恢复新进程运行环境
//cpu寄存器：psw，pc，ir，当要中间切换进程pcb中保存下
//总结：更新pcb中的信息（运行环境，state），将pcb插入合适的队列，分配/回收资源

//13.
//进程通信（IPC）
//两个或多个进程差生了数据交互
//共享存储：
//申请共享存储区，各个进程访问互斥（操作系统内核提供同步互斥工具PV操作）
//基于数据结构的共享--低级通信
//基于存储区的共享--高级通信
//消息传递：
//以格式化的消息为单位，进程通过操作系统提供的“发送消息/接收消息”两个原语进行数据交换
//消息头+消息体
//直接通信方式（消息发送进程要指明接收进程的id）：
//发送原语：send（接收方，msg）->进程Q消息队列->接受原语：receive（发送方，&msg）
//间接通信方式（通过“信箱”间接的通信。因此又称“信箱通信方式”
//进程p像操作系统申请“信箱”->send（信箱，msg）->进程Q：receive（信箱，&msg）
//可以多个进程对一个信箱
//管道通信：
//“管道”是一个特殊的共享文件，又名pipe文件。其实就是在内存中开辟一个大小固定的内存缓冲区
//与共享存储不同的是有优先级先进先出（循环队列，数据流的形式）而不是无限制
//管道只能采用“半双工通信”（同一时刻只能实现单向传输）。如果要实现全双工通信，则要设置两个管道
//各个进程互斥访问管道
//管道中的数据一旦被读出，就彻底消失，多个进程同时读一个管道可能会错乱：1.一个管道允许多个写进程一个读进程2.让读进程轮流从管道中读数据

//14.
//信号
//信号量：实现进程间的同步互斥
//信号:实现进程间的通信（ipc）
//用于通信某个进程特定事件已经发生，收到后处理
//原理
//每个信号通过宏编号，pending待处理信号blocked被阻塞信号：都由位相量组成（桶）
//当一个进程从内核态转为用户态的时候，例行检查是否有待处理信号
//blocked按位取反然后和pending进行&运算
//1/操作系统有默认的处理程序2/用户自定义
//重复收到同类信号，丢弃（1bit记录一类待处理信号）
//同时收到，先小
//信号可以作为异常的·配套机制，让进程对操作系统的异常处理进行补充

//15.
//线程的概念与特点：
//引入线程后，线程成为了程序执行流的最小单位（”轻量级进程“）也是基本的cpu执行单元
//不仅进程可以并发，线程间也可以并发，提升系统的并发度
//进程只作为除cpu之外的系统资源分配单位
//同一进程间的线程切换不需要接环运行环境，系统开销减少
//属性：见图

//16.
//线程的实现方式和多线程模型
//用户级线程：
//早期操作系统只支持进程不支持线程，线程有线程库实现，实现线程的创建调度和销毁
//线程切换在用户态不需要变态，开销小，效率高
//操作系统意识不到线程，当一个用户级线程被阻塞，整个进程都会被阻塞，不能在处理机并行运行
//内核级线程：
//由操作系统支持的线程，需要cpu的变态在核心态下完成，并发能力强，但开销大
//多线程模型：
//一对一（一个用户级线程对应一个内核级线程）
//多对一……内核级线程才是处理机分配的单位
//多对多，克服一对一占用太多内核级线程开销大，克服多对一模型并发度不高的缺点
//一段用户线程（“代码逻辑”）只有获得了内核级线程（“运行机会”）才能被cpu执行，内核级线程可以运行任意一个有映射关系的用户级线程

//17.
//线程的状态与转换：
//与进程的转换完全一致
//TCB线程控制块：
//线程标识符：TID
//程序技术器PC：线程目前执行到哪
//其他寄存器：线程运行的中间结果
//堆栈指针：保存调用信息，局部变量
//线程运行状态：运行/就绪/阻塞
//优先级：线程调度，资源分配的参考
//线程表：TCB组织一张

//18.
//处理机调度的概念层次：
//有一些任务要处理时，由于资源有限，没办法同时处理。需要确定某种规则来确定这些任务的顺序
//高级调度（作业调度）：好几个程序要启动，到底先启动哪个，从作业队列挑选一个调入内存（创建PCB），调出撤销PCB，每个作业只能一次
//低级调度（进程调度/处理机调度）：
//从就绪队列中选一个进程，处理机分配给他，最基本频率很高
//中级调度（内存调度）：
//内存不够某些程序调出外存，然后在重新调入内存
//等待状态--挂起状态，成挂起队列
//按照某种策略决定哪个处于挂起状态的进程重新调入内存，一个进程会多次调入调出内存，频率比高级调度高
//就绪挂起：在就绪态因内存挂起，激活，还可由创建态，运行态，阻塞挂起态达到
//阻塞挂起：在阻塞态因内存挂起，激活/或(某事件出现)->就绪挂起
//阻塞态的进程映像在内存，挂起在外存
//三层调度的联系对比见图































